{"data":{"markdownRemark":{"html":"<p>Футбол хорошо освещается, это самый популярный вид спорта на планете и хорошо оплачиваемый. За один футбольный матч в Английской премьер лиге каждая из команд получает по 4.2 миллиона фунтов стерлинга минимум. Самые лучшие игроки получают огромные деньги, как например Лионель Месси с зарплатой 256 &#x3C;упс новый контракт> тысяч фунтов стерлинга в неделю.\nРазработчики программного обеспечения и команды, в которых они работают такие же звезды современного мира. Большинство людей слышали про Марка Цукенберга, как и о Лионеля Месси. Зарплата программиста так же выше &#x3C;на сколько> средней зарплаты других профессий.\nЯ вижу что между футболом и программирование много общего &#x3C;только зарплата?>, возможно из-за, того что это две вещи, которые больше всего меня интересовали профессионально.\nStriker\n&#x3C;главная цель нападающих забивать голы без которых не выйграть игру>\nЭти игроки имеют самую высокую зарплату. От таких игроков ждут результативности. Нападающие редко вовлечены в командные действия без мяча. Часто остаются на острие атаки, там где они могут быть результативными, там где могут забивать голы.\nПрограммист, герой способный решить судьбу команды/компании.\nCreative players\nИгроки создающие игру playmakers. Любят рисковать, потому что могут, способны создать моменты, решать игру, но они оставляют позиции, остаются впереди не помогая партнерам защищаться и могут подставить команду под контр-атаку.\nТакой программист будет создавать больше остальных, быть самым продуктивным в самых сложных задачах, но он склонен оставлять за собой мертвый код, лишние комментарии, не протестированные части приложения или технический долг, ломать билды, оставлять баги.\nCentral midfielders\nЦентральные полузащитники возят рояль. Их задача делать всю черновую работу, брать нагрузку на себя. Без них любые звезды будут бесполезны, они останутся без меча, будут отрезаны от команды.\n&#x3C;Кто центральные защитник в команде разработчиков?>\nDefensive midfielders\n&#x3C;не позволяет ошибкам случатся>\nDefenders (CB?/FB? or together?)\n…\nGoalkeeper\n&#x3C;спасает тогда когда допущены ошибки>\nВ команде всегда есть человек к которому вы бежите, когда у вас уже большие проблемы. Этот человек уверен, спокоен в таких ситуациях у него много опыта и он способен спасти ситуацию.\nДелают спасения в футболе вратари. Спасения так же зрелищны и захватывающе как голы.\n&#x3C;ссылка на подборку вратарских спасений>\nCoach\n&#x3C;отвечает за действия команды вне поля>\nСтратег. Должен видеть что будет с командой завтра, через неделю, в следующем сезоне.\nCaptain\n&#x3C;отвечает за действия команды на поле>\nМенеджер не способен скоректировать действия &#x3C;не совсем так> на поле во время игры, но капитан команды может. Он тактик на поле.\nYouth\nКажется никто не любит брать на работу сотрудников без опыта и навыков. Младшие разработчики совершают ошибки, пишут плохой код, у них уходит больше времени на те же задачи, требуют времени старших для входа в проект, поиска решения или понимания задачи. Всегда проще добиться результата с помощью больших денег.\nВ футболе клубы тратят огромные деньги для получения результата здесь и сейчас, но меня всегда поражали клубы у которых первые скупают таланты из года в год. Кажется у клубов способных находить и взращивать таланты есть что-то, что помогает им быть относительно успешными даже когда у тебя покупают очередного лидера или вундеркинда. Клубы - академии получают десятки милионов фунтов и евро, а через год у них уже новое поколение, которое готовы купить за столько же. Саутгемптон из Англии, Порто из одноименного города, Спортинг из Лисабона, Аякс из Амстердама, Динамо из Загреба. Эти клубы взращивают и продают не одно поколение футбольных звезд.\n&#x3C;за счет чего это у них получается?>\nВоспитывание молодеж сложно и важно. Это не дает результат сейчас и даже завтра. Это делает компанию стабильной в долгосрочной перспективе. &#x3C;или это другой стиль работы когда у тебя нет больших денег>\nWe can learn from most popular sport in the world\n&#x3C;заключение></p>","frontmatter":{"title":"A look at a software development team through football","description":null,"related":null}}},"pageContext":{"slug":"/blog/draft/0000-00-00-look-at-softwate-team-through-football/","previous":{"fields":{"slug":"/blog/draft/0000-00-00-math-tricks-for-developers/"},"frontmatter":{"title":"Math tricks for developers (consider more marketish title)","description":null,"date":null}},"next":null}}