{"data":{"markdownRemark":{"html":"<p>As a developer, I have always been interested to become better. Taking courses, reading books and articles, listening to podcasts and watching live coding, screencasts and conferences all these activities were part of my life. But my level hasn’t been changing too much.</p>\n<p>Working on some tasks, I felt as if I was hitting the wall, missing something, doing them wrong.</p>\n<blockquote>\n<p>I missed one crucial aspect — a practice.</p>\n</blockquote>\n<h2>What skill to practice?</h2>\n<p>Skills are divided on hard and soft categories. Soft skills will determine your potential to grow. Hard skills determine your ability to perform a task.</p>\n<h3>Hard skills</h3>\n<blockquote>\n<p>Hard skills are specific, teachable abilities that can be defined and measured, such as typing, writing, math, reading and the ability to use software programs. By contrast, soft skills are less tangible and harder to quantify, such as etiquette, getting along with others, listening and engaging in small talk…</p>\n<p><a href=\"https://www.investopedia.com/terms/h/hard-skills.asp#ixzz5O9zq59IL\">source</a></p>\n</blockquote>\n<p>Examples of hard skills:</p>\n<p>Algorithms, data structures, programming languages, frameworks, tools, programming techniques, system and database design, patterns, refactoring, troubleshootimg and debugging, problem-solving, ability to understand a business domain, math, logic, writing, typing.</p>\n<h3>Soft skills</h3>\n<blockquote>\n<p>Soft skills are character traits and interpersonal skills that characterize a person’s relationships with other people. In the workplace, soft skills are considered a complement to hard skills, which refer to a person’s knowledge and occupational skills. Sociologists may use the term soft skills to describe a person’s “EQ” or “Emotional Intelligence Quotient,” as opposed to “IQ” or “Intelligence Quotient.”</p>\n<p><a href=\"https://www.investopedia.com/terms/s/soft-skills.asp#ixzz5OA07jwly\">source</a></p>\n</blockquote>\n<p>Examples of soft skills:</p>\n<p>Ability to learn, ability to explain and teach, positive approach, willing to take challenges, adaptability, patience, empathy, creativity, communication, self-motivation, self-management, open-mindness, leadership, responsibility, accountability, teamwork, decisiveness, ability to work under pressure and timeline, flexibility, negotiation and conflict resolutions, perseverance, discipline.</p>\n<h3>Concentrate on skills that makes difference</h3>\n<p>There is an immersive amount of skills that can affect how good you are as a programmer.</p>\n<p>You may concentrate on skills that make you feel passion. Your passion will drive you to level up your skills. Stronger skills will give you a feeling of passion for what you are doing. Passion for skills. Skills for passion.</p>\n<h2>Four steps to become better</h2>\n<p><strong>First</strong>, a clear vision. The vision of yourself in the future, who you dream to become. Make this vision as detailed as possible.</p>\n<p><strong>Second</strong>, In order to become your vision, you need to identify goals. It is important to decide in what time range you want to achieve your goals. One year is a good distance, two years suit for junior developers and newcomers in new technology.</p>\n<p><strong>Third</strong>, Now you need to understand how to achieve your goals.</p>\n<p><strong>Four</strong>, you have half of success. Another half of success is hard work. Hard work means focus, persistence, repetition.</p>","frontmatter":{"title":"Programming workout","description":"The way to become a better programmer through repetitive exercises","related":null}}},"pageContext":{"slug":"/blog/tech/2018-09-11-programming-workout/","previous":{"fields":{"slug":"/blog/tech/2018-03-27-how-to-use-webpacker-with-npm-instead-of-yarn-rails-guide/"},"frontmatter":{"title":"How to use Webpacker with npm instead of Yarn, Rails guide","description":"This article will guide you how to replace Yarn with npm for Webpacker gem.","date":"2018-03-27T00:00:00.000Z"}},"next":null}}