{"data":{"markdownRemark":{"html":"<p>As a developer, I have always been interested to become better. Taking courses, reading books and articles, listening to podcasts and watching live coding, screencasts and conferences all these activities were part of my life. But my level hasn’t been changing too much.</p>\n<p>Working on some tasks, I felt as if I was hitting the wall, missing something, doing them wrong.</p>\n<blockquote>\n<p>I missed one crucial aspect — a practice.</p>\n</blockquote>\n<h2>What skill to practice?</h2>\n<p>Skills are divided on hard and soft categories. Soft skills will determine your potential to grow. Hard skills determine your ability to perform a task.</p>\n<h3>Hard skills</h3>\n<blockquote>\n<p>Hard skills are specific, teachable abilities that can be defined and measured, such as typing, writing, math, reading and the ability to use software programs. By contrast, soft skills are less tangible and harder to quantify, such as etiquette, getting along with others, listening and engaging in small talk…</p>\n<p><a href=\"https://www.investopedia.com/terms/h/hard-skills.asp#ixzz5O9zq59IL\">source</a></p>\n</blockquote>\n<p>Examples of hard skills:</p>\n<p>Algorithms, data structures, programming languages, frameworks, tools, programming techniques, system and database design, patterns, refactoring, troubleshootimg and debugging, problem-solving, ability to understand a business domain, math, logic, writing, typing.</p>","frontmatter":{"title":"Programming workout","description":"The way to become a better programmer through repetitive exercises","related":null}}},"pageContext":{"slug":"/blog/tech/2018-09-11-programming-workout/","previous":{"fields":{"slug":"/blog/tech/2018-03-27-how-to-use-webpacker-with-npm-instead-of-yarn-rails-guide/"},"frontmatter":{"title":"How to use Webpacker with npm instead of Yarn, Rails guide","description":"This article will guide you how to replace Yarn with npm for Webpacker gem.","date":"2018-03-27T00:00:00.000Z"}},"next":null}}