{"data":{"markdownRemark":{"html":"<p>As a developer, I have always been interested to become better. Taking courses, reading books and articles, listening to podcasts and watching live coding, screencasts and conferences all these activities were part of my life. But my level hasn’t been changing too much.</p>\n<p>Working on some tasks, I felt as if I was hitting the wall, missing something, doing them wrong.</p>\n<blockquote>\n<p>I missed one crucial aspect — a practice.</p>\n</blockquote>\n<h2>What skill to practice?</h2>\n<p>Skills are divided on hard and soft categories. Soft skills will determine your potential to grow. Hard skills determine your ability to perform a task.</p>\n<h3>Hard skills</h3>\n<blockquote>\n<p>Hard skills are specific, teachable abilities that can be defined and measured, such as typing, writing, math, reading and the ability to use software programs. By contrast, soft skills are less tangible and harder to quantify, such as etiquette, getting along with others, listening and engaging in small talk…</p>\n<p><a href=\"https://www.investopedia.com/terms/h/hard-skills.asp#ixzz5O9zq59IL\">source</a></p>\n</blockquote>\n<p>Examples of hard skills:</p>\n<p>Algorithms, data structures, programming languages, frameworks, tools, programming techniques, system and database design, patterns, refactoring, troubleshootimg and debugging, problem-solving, ability to understand a business domain, math, logic, writing, typing.</p>\n<h3>Soft skills</h3>\n<blockquote>\n<p>Soft skills are character traits and interpersonal skills that characterize a person’s relationships with other people. In the workplace, soft skills are considered a complement to hard skills, which refer to a person’s knowledge and occupational skills. Sociologists may use the term soft skills to describe a person’s “EQ” or “Emotional Intelligence Quotient,” as opposed to “IQ” or “Intelligence Quotient.”</p>\n<p><a href=\"https://www.investopedia.com/terms/s/soft-skills.asp#ixzz5OA07jwly\">source</a></p>\n</blockquote>\n<p>Examples of soft skills:</p>\n<p>Ability to learn, ability to explain and teach, positive approach, willing to take challenges, adaptability, patience, empathy, creativity, communication, self-motivation, self-management, open-mindness, leadership, responsibility, accountability, teamwork, decisiveness, ability to work under pressure and timeline, flexibility, negotiation and conflict resolutions, perseverance, discipline.</p>\n<h3>Concentrate on skills that makes difference</h3>\n<p>There is an immersive amount of skills that can affect how good you are as a programmer.</p>\n<p>You may concentrate on skills that make you feel passion. Your passion will drive you to level up your skills. Stronger skills will give you a feeling of passion for what you are doing. Passion for skills. Skills for passion.</p>\n<h2>Four steps to become better</h2>\n<p><strong>First</strong>, a clear vision. The vision of yourself in the future, who you dream to become. Make this vision as detailed as possible.</p>\n<p><strong>Second</strong>, In order to become your vision, you need to identify goals. It is important to decide in what time range you want to achieve your goals. One year is a good distance, two years suit for junior developers and newcomers in new technology.</p>\n<p><strong>Third</strong>, Now you need to understand how to achieve your goals.</p>\n<p><strong>Four</strong>, you have half of success. Another half of success is hard work. Hard work means focus, persistence, repetition.</p>\n<h2>Build a workout</h2>\n<p>Barbara Oakley with her <a href=\"https://www.coursera.org/learn/learning-how-to-learn\">course “Learning how to learn”</a> explains that repetition, recalling, rest, chunking are the keys to learning well. It means that good practice should be short in time, concentrated on one bite, repetitive, persistent and subject under studying should be practiced in different context.</p>\n<p>Below are three workout examples. Each contains four steps and based on the fundamental principles of learning.</p>\n<h3>General productivity</h3>\n<p>“Become a productive developer, with a lot of knowledge and strong problem-solving skill” — is a good example of vision.</p>\n<p>What really matters when we talk about the productivity of a programmer? Googling for a solution, hacking code that doesn’t work, doing mundane things manually, using framework or language in a non-productive way. These activities may stop you to be a productive developer on a day to day basis.</p>\n<p><strong>Goal #1</strong> Know patterns, algorithms, tools, bash</p>\n<p>How to achieve: learn one pattern, algorithm or tool command at a time and practice it;</p>\n<p><strong>Goal #2</strong> Problem solver</p>\n<p>How to achieve: solve problems from exercise books and sites on the <a href=\"https://codeburst.io/10-steps-to-solving-a-programming-problem-8a32d1e96d74\">right way</a>.</p>\n<p><strong>Goal #3</strong> Exceptional debugging skills;</p>\n<p>How to achieve: apply debugging techniques at <a href=\"https://stackoverflow.com/questions\">StackOverflow questions</a> related to bugs.</p>\n<p><strong>Goal #4</strong> Type fast and clean, produce code faster with Vim editor</p>\n<p>How to achieve: practice touch typing with <a href=\"https://www.typingclub.com/\">typingclub.com</a>; learn the editor tricks and features;</p>\n<hr>\n<p><strong>Monday workout:</strong></p>\n<p>touch type practice, 15 mins;\npractice a design pattern from the <a href=\"https://www.amazon.com/Design-Patterns-Object-Oriented-Addison-Wesley-Professional-ebook-dp-B000SEIBB8/dp/B000SEIBB8/ref=as_li_ss_tl?_encoding=UTF8&#x26;me=&#x26;qid=&#x26;dpID=51kuc0iWoKL&#x26;preST=_SY445_QL70_&#x26;dpSrc=detail&#x26;linkCode=ll1&#x26;tag=sdm05-20&#x26;linkId=f477278b66cd9aae4e60b9726e7e8ee1&#x26;language=en_US\">Design Patterns book</a> on a fictional project for 30 mins; rotate patterns, do not continue your previous work, always start from scratch;\nsolve a problem from <a href=\"https://exercism.io/\">exercism.io</a>, 15 mins.</p>\n<p><strong>Wednesday workout:</strong></p>\n<p>practice next Vim feature, 15 mins;\npractice one algorithm or data structure from <a href=\"https://www.hackerrank.com/domains/algorithms\">Hackerrank</a> for 15 mins;\nfix one bug on StackOverflow, 30 mins.</p>\n<p><strong>Friday workout:</strong></p>\n<p>touch type practice 15 mins;\npractice bash utils for 15 mins;\npractice any tool you interested in ack, git, etc for 15 mins;\nsolve a problem from exercism.io, 15 mins.</p>\n<h3>Become a exceptional Node.JS developer</h3>\n<p>“Study Node.JS from top to bottom, know every quirk of JavaScript, know ecosystem and being involved in the community” — is a vision for an exceptional Node.JS developer.</p>\n<p>Being an expert in any field is a matter of learning and practice.</p>\n<p><strong>Goal #1</strong> Know all about JavaScript</p>\n<p>How to achieve: practice through JavaScript reference; read good books you don’t know JS series (can read for free on GitHub), JavaScript: The Good Parts, Secrets of the JavaScript Ninja.</p>\n<p><strong>Goal #2</strong> Have an exceptional knowledge of Node.JS</p>\n<p>How to achieve: practice every module from Node.JS docs</p>\n<p><strong>Goal #3</strong> Be involved in Node.JS ecosystem</p>\n<p>How to achieve: contribute to beloved Node.JS project</p>\n<hr>\n<p><strong>Monday-Friday related activities:</strong></p>\n<p>read next great book about JavaScript or Node.JS in spare time, 30–60 mins a day is recommended.</p>\n<p><strong>Monday workout:</strong></p>\n<p>practice one chapter from <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference\">MDN JavaScript reference</a>, 15 mins;\ncontribute to <a href=\"https://github.com/strapi/strapi\">Strapi</a> or <a href=\"https://github.com/gatsbyjs/gatsby\">Gatsby</a> project, 30 mins;</p>\n<p><strong>Wednesday workout:</strong></p>\n<p>practice one chapter from MDN JavaScript reference, 20 mins;\npractice one module from Node.JS documentation, 20 mins;</p>\n<p><strong>Friday workout:</strong></p>\n<p>practice one module from Node.JS documentation, 15 mins;\ncontribute to Strapi or Gatsby project, 30 mins;</p>\n<h3>Ruby refactorist</h3>\n<p>“A Ruby developer who able to save a project that comes in a bad shape, fix a code that teammates avoid touching, by all means by making complex things simpler” — this is a narrow perk but a really special one, many colleagues will appreciate it.</p>\n<p>Goal #1 Be able to refactor legacy ruby codebase</p>\n<p>How to achieve: practice Behavior Driven Development (BDD), refactor legacy code base on open source project</p>\n<p>Goal #2 Be able to reduce codebase complexity</p>\n<p>How to achieve: with <a href=\"https://books.thoughtbot.com/assets/ruby-science.pdf\">Ruby science book</a> learn to spot code smells and illuminate them; practice refactoring methods from <a href=\"https://www.amazon.com/Refactoring-Improving-Existing-Addison-Wesley-Signature-ebook/dp/B07LCM8RG2/ref=sr_1_1?keywords=Refactoring&#x26;qid=1560064888&#x26;s=digital-text&#x26;sr=1-1\">Refactoring book</a></p>\n<p>Goal #3 Master of improving project design</p>\n<p>How to achieve: master Domain Driven Design, Hexoganal architecture, practice classical design pattern from <a href=\"https://www.amazon.com/Design-Patterns-Object-Oriented-Addison-Wesley-Professional-ebook-dp-B000SEIBB8/dp/B000SEIBB8/ref=as_li_ss_tl?_encoding=UTF8&#x26;me=&#x26;qid=&#x26;dpID=51kuc0iWoKL&#x26;preST=_SY445_QL70_&#x26;dpSrc=detail&#x26;linkCode=ll1&#x26;tag=sdm05-20&#x26;linkId=f477278b66cd9aae4e60b9726e7e8ee1&#x26;language=en_US\">Design Patterns book</a>.</p>\n<hr>\n<p><strong>Workout for Monday, Wednesday, and Friday:</strong></p>\n<ul>\n<li>refactor one codebase with writing BDD and improving code, multiple times, at least 3 times, per 10 mins; then delete your refactor work and tests and start again, 30 mins total;</li>\n<li>practice one code smell by taking one source project of your choice, find this code smell and get rid of it, do it for 15 mins; practice on a set of 2–3 projects, rotate code smells that you fixing;</li>\n<li>practice a pattern from the Design Patterns book, by implementing the pattern on a fictional project for 15 mins, rotate patterns; do not continue the previous work, always start from scratch;</li>\n<li>practice new architecture with a fictional app for 30 mins; do not continue the previous work, always start from scratch.</li>\n</ul>\n<p>As a bonus to your practicing, you may make a PR with the final version of refactoring to a project under refactoring repository. Make PRs from an at least 3rd version of refactoring.</p>","frontmatter":{"title":"Programming workout","description":"The way to become a better programmer through repetitive exercises","related":null}}},"pageContext":{"slug":"/blog/tech/2018-09-11-programming-workout/","previous":{"fields":{"slug":"/blog/tech/2018-03-27-how-to-use-webpacker-with-npm-instead-of-yarn-rails-guide/"},"frontmatter":{"title":"How to use Webpacker with npm instead of Yarn, Rails guide","description":"This article will guide you how to replace Yarn with npm for Webpacker gem.","date":"2018-03-27T00:00:00.000Z"}},"next":null}}