{"data":{"markdownRemark":{"html":"<blockquote>\n<p>This book is about writing cost-effective, maintainable, and pleasing code … [by] … finding the right abstractions.</p>\n<p>Sandi Metz, Katrina Owen. 99 Bottles of OOP (Kindle Locations 119–120, 213). Kindle Edition.</p>\n</blockquote>\n<h2>Authors</h2>\n<p><a href=\"https://www.sandimetz.com/\">Sandi Metz</a> and <a href=\"https://www.kytrinyx.com\">Katrina Owen</a>.</p>\n<p>Sandi is a programmer, teacher, author and consultant.</p>\n<p>Katrina is a Go and Ruby programmer, creator of <a href=\"https://exercism.io\">exercism</a>.</p>\n<h2>Facts</h2>\n<p>This book is available in two verstions: 99 Bottles of Beer and 99 Bottles of Milk.</p>\n<p>The book has 187 code examples not counting examples from appendix content. All code written in Ruby.</p>\n<h2>For whom</h2>\n<p>The book will be interesting to those who are looking to improve their Object Oriented Design (hereinafter OOD) skills.</p>\n<p>Ideas in “99 Bootles of OOP” will be teachable for Object-Oriented Programming (hereinafter OOP) novice and experienced programmers.</p>\n<p>Authors warn that programmers with existing OOP knowledge may absorb the material with difficulty or dislike if the concepts differ from their experience.</p>\n<h2>How to read</h2>\n<p>Sequentially, chapters depend one on another.</p>\n<p>The best effect from the book will be achieved by work the code samples from the book. Those knowing Ruby programming language is valuable, hence the samples are made in Ruby.</p>\n<p>Since you understand the code examples you can write exercises in any programming language that you comfortable with.\nYou can check the code from all chapters <a href=\"https://github.com/sandimetz/99bottles\">here</a>.</p>\n<h2>Content</h2>\n<p><strong>The first chapter</strong> introduces the problem and initial solutions that you can come up to, as well as metrics to objectively compare the solutions. Before you start reading this chapter it is better to solve the problem by yourself.</p>\n<p><strong>The 2nd chapter</strong> is about Test Driven Development (hereinafter TDD). The chapter illustrates how to incrementally write tests which drive the development code. This approach leads to better code and difference between effective tests and costly to maintain tests.</p>\n<p><strong>The 3rd chapter</strong> is about how to handle new requirements, about those feeling when you no longer like the code that results from the implementation of new features and sees no options to do it in another way. This chapter reveals how to handle it with Open/Close principle, by identifying and removing smells, that make it difficult to see hidden abstractions.</p>\n<p><strong>The 4th chapter</strong> continues to practice ideas from 3rd chapter with slightly more complex tasks. It reveals the importance of consistency in the code, which empowers us to make refactoring and lower cost by simplifying reading, the most common action on a code. The chapter emphasizes the importance to stick with refactoring rules. It explains the Liskov substitution principle.</p>\n<p><strong>The 5th chapter</strong> demonstrates the next smell in the code and the next step to fix it by applying extract class refactoring. It explains the importance of messaging in OOP. Also, the chapter touches such topics as premature performance optimization, caching and immutability.</p>\n<p><strong>In the 6th chapter</strong>, the authors will explain how to solve the requirement introduced earlier in the book. In order to do this, you explore Data clump code smell and replace if/switch statement with a set of polymorphic objects created by a factory.</p>","frontmatter":{"title":"99 Bottles of Object Oriented Programming","description":"Book review of “99 Bottle of OOP” by Sandi Metz and Katrina Owen","related":null}}},"pageContext":{"slug":"/blog/tech/2019-03-11-99-bottles-of-oop/","previous":{"fields":{"slug":"/blog/tech/2019-02-11-essential-books-that-every-programmer-should-read/"},"frontmatter":{"title":"Essential Books That Every Programmer Should Read","description":"The books recommendations from the Bozhidar's talk, lists by Uncle Bob, and Kent Beck, books from blog posts by Jeff Atwood and DHH.","date":"2019-02-11T00:00:00.000Z"}},"next":{"fields":{"slug":"/blog/tech/0000-00-00-look-at-softwate-team-through-football/"},"frontmatter":{"title":"A look at a software development team through football","description":null,"date":null}}}}